app/controllers/api/ledgers_controller.rb

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 11
---
	def get_ledger_totals
		expenses = Transaction.get_total_expense_by_date(params[:ledger_id],params[:year],params[:month])
		revenues = Transaction.get_total_revenue_by_date(params[:ledger_id],params[:year],params[:month])
		ledger_totals = {:total_expenses => expenses.sum(&:amount), :total_revenue => revenues.sum(&:amount)}