app/controllers/api/ledgers_controller.rb

	def index
		ledgers = Ledger.order("created_at DESC")
---
SELECT `ledgers`.* FROM `ledgers` ORDER BY created_at DESC

	def show
		ledger = Ledger.find(params[:id])
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 LIMIT 1

	def create
		ledger = Ledger.new(ledger_params)
		if ledger.save
---
INSERT INTO `ledgers` (`name`, `starting_balance`, `created_at`, `updated_at`) VALUES ('San Francisco General Ledger', 100.0, '2020-10-04 11:25:24.537505', '2020-10-04 11:25:24.537505')

	def destroy
		ledger = Ledger.find(params[:id])
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 11 LIMIT 1

	def update
		ledger = Ledger.find(params[:id])
		if ledger.update(ledger_params)
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 LIMIT 1
UPDATE `ledgers` SET `ledgers`.`name` = 'Updated name', `ledgers`.`starting_balance` = 100.0, `ledgers`.`updated_at` = '2020-10-03 18:27:25.913106' WHERE `ledgers`.`id` = 1

	def get_ledger_totals
		ledger_transactions = Ledger.where(id: params[:ledger_id]).includes(:transactions)
		total_expenses = ledger_transactions.first.transactions.expense
		expenses = total_expenses.by_year(params[:year]).by_month(params[:month])
		total_revenue = ledger_transactions.first.transactions.revenue
		revenues = total_revenue.by_year(params[:year]).by_month(params[:month])
		total_expense = expenses.sum(&:amount)
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 ORDER BY `ledgers`.`id` ASC LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 11 AND `transactions`.`type` = 'Revenue'
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 1
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 1 AND `transactions`.`type` = 'Expense' AND (extract(year  from date) = '2020') AND (extract(month  from date) = '02')

	def get_current_balance
		ledger_transactions = Ledger.where(id: params[:ledger_id]).includes(:transactions)
		starting_balance = ledger_transactions.first.starting_balance
		expense = ledger_transactions.first.transactions.expense
		revenue = ledger_transactions.first.transactions.revenue
		current_balance = starting_balance + revenue.sum(&:amount) - expense.sum(&:amount)
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 1 AND `transactions`.`type` = 'Expense' AND (extract(year  from date) = '2020') AND (extract(month  from date) = '01')
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` IS NULL ORDER BY `ledgers`.`id` ASC LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 1
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 ORDER BY `ledgers`.`id` ASC LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 1 AND `transactions`.`type` = 'Revenue'