app/controllers/api/transactions_controller.rb

 	def create
 		ledger = Ledger.find(params[:ledger_id])
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 11 LIMIT 1

 	def list_transactions
 		ledger = Ledger.find(params[:ledger_id])
 		transactions = ledger.transactions.order("created_at DESC")
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 4 ORDER BY created_at DESC