app/controllers/api/transactions_controller.rb

SELECT `transactions`.* FROM `transactions` ORDER BY created_at DESC
---
	def index
 		transactions = Transaction.order("created_at DESC")

INSERT INTO `transactions` (`ledger_id`, `amount`, `date`, `type`, `description`, `created_at`, `updated_at`) VALUES (11, 26.3, '2020-02-25', 'Expense', 'Note books', '2020-10-05 02:10:21.794217', '2020-10-05 02:10:21.794217')
---
 	def create
 		transaction = Transaction.new(transaction_params)
 		if transaction.save

SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 1 LIMIT 1
INSERT INTO `transactions` (`ledger_id`, `amount`, `date`, `type`, `description`, `created_at`, `updated_at`) VALUES (1, 8.79, '2020-01-22', 'Expense', 'Pencils', '2020-10-04 07:37:44.134820', '2020-10-04 07:37:44.134820')
---
 	def create_transaction
 		ledger = Ledger.find(params[:ledger_id])
 		transaction = Transaction.new(transaction_params)
 		ledger.transactions << transaction

SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 10 LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 10 ORDER BY created_at DESC
---
 	def list_transactions
 		ledger = Ledger.find(params[:ledger_id])
 		transactions = ledger.transactions.order("created_at DESC")