app/models/transaction.rb

	def self.get_total_expense(ledger_id,year,month)
		ledger = Ledger.find(ledger_id)
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 11 LIMIT 1

	def self.get_total_revenue(ledger_id,year,month)
		ledger = Ledger.find(ledger_id)
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`ledger_id` = 10 AND `transactions`.`type` = 'Revenue'
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 10 LIMIT 1  [["id", 10], ["LIMIT", 1]]